src/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Comment>Автор варианта отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Видимость</Name>
					<Comment>Вариант видим всем пользователям по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчаниюПереопределена</Name>
					<Comment>Когда Истина то вместо флажка ВидимостьПоУмолчанию используется значение аналогичного флажка предопределенного варианта отчета.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивнаяПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевыеСлова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияПараметровИОтборов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Comment>АПК:1329 - в таблице предполагается мало записей (в ERP ~ 1200) - оптимизация не требуется</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользовательский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Comment>Вариант конфигурации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеВариантыОтчетовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВариантаОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаВидимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подсистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Размещение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Важный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмТакже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НастройкиВариантовОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВариантовОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БыстрыйДоступ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Образец</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рекомендуемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункциональнаяОпция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Устаревший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИзмененаПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Требуется для подключения команд дополнительных отчетов и обработок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ВариантыОтчетов/Forms/РедактированиеВидимости/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СписокПользователей = Параметры.Пользователи;
	Параметры.Свойство("ВариантОтчета", ВариантОтчета);
	Если Параметры.Свойство("ПользователиВариантаРедактирование") Тогда
		Для Каждого ЭлементСписка ИЗ Параметры.ПользователиВариантаРедактирование Цикл 
			НоваяСтрока 					= ДоступностьРедактирование.Добавить();
			НоваяСтрока.ПользовательРоль 	= ЭлементСписка.Значение;
			НоваяСтрока.Доступность 		= ЭлементСписка.Пометка;
			НоваяСтрока.Представление 		= ЭлементСписка.Представление;
		КонецЦикла;	
	КонецЕсли;
	ДоступенВсем 		= СписокПользователей.Количество() = 0;
	
	Если ЗначениеЗаполнено(СписокПользователей.ДоступныеЗначения) Тогда 
		Для Каждого ДоступноеЗначение Из СписокПользователей.ДоступныеЗначения Цикл 
			Если ТипЗнч(ДоступноеЗначение.Значение) = Тип("СправочникСсылка.Сотрудники") Тогда 
				СтрокаПользователя              	= ДоступностьПользователей.Добавить();
				СтрокаПользователя.Пользователь 	= ДоступноеЗначение.Значение;
				СтрокаПользователя.Представление 	= ДоступноеЗначение.Представление;
				Если ДоступенВсем Тогда 
					СтрокаПользователя.Видимость 	= Истина;
				Иначе
					ДоступныйЭлементСписка 			= СписокПользователей.НайтиПоЗначению(ДоступноеЗначение.Значение);
					СтрокаПользователя.Видимость 	= ?(ДоступныйЭлементСписка = Неопределено, Ложь, Истина);
				КонецЕсли;
			ИначеЕсли ТипЗнч(ДоступноеЗначение.Значение) = Тип("ПеречислениеСсылка.РольПользователя") Тогда
				СтрокаПользователя              	= ДоступностьРолей.Добавить();
				СтрокаПользователя.Пользователь 	= ДоступноеЗначение.Значение;
				СтрокаПользователя.Представление 	= ДоступноеЗначение.Представление;
				Если ДоступенВсем Тогда 
					СтрокаПользователя.Видимость 	= ДоступноеЗначение.Пометка;
				Иначе
					ДоступныйЭлементСписка 			= СписокПользователей.НайтиПоЗначению(ДоступноеЗначение.Значение);
					СтрокаПользователя.Видимость 	= ?(ДоступныйЭлементСписка = Неопределено, Ложь, Истина);
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
			
	Иначе
		// Старый механизм заполнения
		
		// Пользователи
		ТЗ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Пользователь, ПРЕДСТАВЛЕНИЕ(Сотрудники.Ссылка) КАК Представление
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ИдентификаторПользователяИБ <> &Идентификатор
		|	И НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.Служебный
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудники.Наименование";
		
		Запрос = Новый Запрос(ТЗ);
		Запрос.УстановитьПараметр("Идентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		УстановитьПривилегированныйРежим(истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(ложь);
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаПользователя              	= ДоступностьПользователей.Добавить();
			СтрокаПользователя.Пользователь 	= Выборка.Пользователь;
			СтрокаПользователя.Представление 	= Выборка.Представление;		
			Если СписокПользователей.Количество() = 0 Тогда 
				СтрокаПользователя.Видимость 	= Истина;
			ИначеЕсли СписокПользователей.НайтиПоЗначению(Выборка.Пользователь) <> Неопределено тогда
				СтрокаПользователя.Видимость 	= Истина;
			Иначе
				СтрокаПользователя.Видимость 	= Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		// Роли
		ТЗ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РолиПользователя.Ссылка КАК РольПользователя, ПРЕДСТАВЛЕНИЕ(РолиПользователя.Ссылка) КАК Представление
		|ИЗ
		|	Перечисление.РольПользователя КАК РолиПользователя";
		
		Запрос = Новый Запрос(ТЗ);
		УстановитьПривилегированныйРежим(истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(ложь);
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаПользователя              	= ДоступностьРолей.Добавить();
			СтрокаПользователя.Пользователь 	= Выборка.РольПользователя;
			СтрокаПользователя.Представление 	= Выборка.Представление;
			Если СписокПользователей.Количество() = 0 Тогда 
				СтрокаПользователя.Видимость 	= Истина;		
			ИначеЕсли СписокПользователей.НайтиПоЗначению(Выборка.РольПользователя) <> Неопределено тогда
				СтрокаПользователя.Видимость 	= Истина;
			Иначе
				СтрокаПользователя.Видимость 	= Ложь;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	ПодсчитатьИтогиПоДоступности();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Принять
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Принять(Команда)
	
	СписокПользователи = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ВариантОтчета) Тогда 
		Для Каждого СтрокаРедактирование Из ДоступностьРедактирование Цикл 
			СписокПользователи.Добавить(СтрокаРедактирование.ПользовательРоль, СтрокаРедактирование.Представление, СтрокаРедактирование.Доступность);
		КонецЦикла;	
	Иначе 		
		Для каждого СтрокаПользователя Из ДоступностьПользователей Цикл
			Если СтрокаПользователя.Видимость Тогда
				СписокПользователи.Добавить(СтрокаПользователя.Пользователь, СтрокаПользователя.Представление);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаПользователя Из ДоступностьРолей	 Цикл
			Если СтрокаПользователя.Видимость Тогда
				СписокПользователи.Добавить(СтрокаПользователя.Пользователь, СтрокаПользователя.Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Структура = Новый Структура("Пользователи", СписокПользователи);
	Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отметить все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОтметитьВсе(Команда)
	
	Если Элементы.ГруппаПользователиРоли.ТекущаяСтраница = Элементы.СтраницаПользователи Тогда
		
		Для Каждого СтрокаПользователя Из ДоступностьПользователей Цикл
			Если НЕ СтрокаПользователя.Видимость Тогда
				РедактированиеПроизводилось = Ложь;
				Для Каждого СтрокаРедактирование Из ДоступностьРедактирование Цикл 
					Если СтрокаРедактирование.ПользовательРоль = СтрокаПользователя.Пользователь Тогда
						РедактированиеПроизводилось = Истина;
						Если НЕ СтрокаРедактирование.Доступность Тогда 
							ДоступностьРедактирование.Удалить(СтрокаРедактирование);
						КонецЕсли;	
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				Если НЕ РедактированиеПроизводилось Тогда 
					СтрокаРедактирования = ДоступностьРедактирование.Добавить();
					СтрокаРедактирования.ПользовательРоль 	= СтрокаПользователя.Пользователь;
					СтрокаРедактирования.Представление 		= СтрокаПользователя.Представление;
					СтрокаРедактирования.Доступность 		= Истина;
				КонецЕсли;	
				СтрокаПользователя.Видимость = Истина;				
			КонецЕсли;	
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаПользователя Из ДоступностьРолей Цикл
			Если НЕ СтрокаПользователя.Видимость Тогда
				РедактированиеПроизводилось = Ложь;
				Для Каждого СтрокаРедактирование Из ДоступностьРедактирование Цикл 
					Если СтрокаРедактирование.ПользовательРоль = СтрокаПользователя.Пользователь Тогда
						РедактированиеПроизводилось = Истина;
						Если НЕ СтрокаРедактирование.Доступность Тогда 
							ДоступностьРедактирование.Удалить(СтрокаРедактирование);
							РольПользователей = СтрокаПользователя.Пользователь;
						КонецЕсли;	
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				Если НЕ РедактированиеПроизводилось Тогда 
					СтрокаРедактирования = ДоступностьРедактирование.Добавить();
					СтрокаРедактирования.ПользовательРоль 	= СтрокаПользователя.Пользователь;
					СтрокаРедактирования.Представление 		= СтрокаПользователя.Представление;
					СтрокаРедактирования.Доступность 		= Истина;
					РольПользователей 						= СтрокаПользователя.Пользователь;
				КонецЕсли;	
				СтрокаПользователя.Видимость 				= Истина;
				УстановитьФлагиПользователямПоРоли(РольПользователей, Истина);
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
	ПодсчитатьИтогиПоДоступности();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Снять отметки
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СнятьОтметки(Команда)
	
	Если Элементы.ГруппаПользователиРоли.ТекущаяСтраница = Элементы.СтраницаПользователи Тогда
		
		Для Каждого СтрокаПользователя Из ДоступностьПользователей Цикл
			Если СтрокаПользователя.Видимость Тогда
				РедактированиеПроизводилось = Ложь;
				Для Каждого СтрокаРедактирование Из ДоступностьРедактирование Цикл 
					Если СтрокаРедактирование.ПользовательРоль = СтрокаПользователя.Пользователь Тогда
						РедактированиеПроизводилось = Истина;
						Если СтрокаРедактирование.Доступность Тогда 
							ДоступностьРедактирование.Удалить(СтрокаРедактирование);
						КонецЕсли;	
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				Если НЕ РедактированиеПроизводилось Тогда 
					СтрокаРедактирования = ДоступностьРедактирование.Добавить();
					СтрокаРедактирования.ПользовательРоль 	= СтрокаПользователя.Пользователь;
					СтрокаРедактирования.Представление 		= СтрокаПользователя.Представление;
					СтрокаРедактирования.Доступность 		= Ложь;
				КонецЕсли;	
				СтрокаПользователя.Видимость = Ложь;				
			КонецЕсли;	
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаПользователя Из ДоступностьРолей Цикл
			Если СтрокаПользователя.Видимость Тогда
				РедактированиеПроизводилось = Ложь;
				Для Каждого СтрокаРедактирование Из ДоступностьРедактирование Цикл 
					Если СтрокаРедактирование.ПользовательРоль = СтрокаПользователя.Пользователь Тогда
						РедактированиеПроизводилось = Истина;
						Если СтрокаРедактирование.Доступность Тогда 
							ДоступностьРедактирование.Удалить(СтрокаРедактирование);
							РольПользователей = СтрокаПользователя.Пользователь;							
						КонецЕсли;	
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				Если НЕ РедактированиеПроизводилось Тогда 
					СтрокаРедактирования = ДоступностьРедактирование.Добавить();
					СтрокаРедактирования.ПользовательРоль 	= СтрокаПользователя.Пользователь;
					СтрокаРедактирования.Представление 		= СтрокаПользователя.Представление;
					СтрокаРедактирования.Доступность 		= Ложь;
					РольПользователей 						= СтрокаПользователя.Пользователь;					
				КонецЕсли;	
				СтрокаПользователя.Видимость 				= Ложь;
				УстановитьФлагиПользователямПоРоли(РольПользователей, Ложь);				
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
	ПодсчитатьИтогиПоДоступности();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - Доступность пользователи при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДоступностьПользователиПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		РедактированиеПроизводилось = Ложь;
		Для Каждого СтрокаРедактирование Из ДоступностьРедактирование Цикл 
			Если СтрокаРедактирование.ПользовательРоль = ТекущиеДанные.Пользователь Тогда
				РедактированиеПроизводилось = Истина;
				Если НЕ СтрокаРедактирование.Доступность = ТекущиеДанные.Видимость Тогда 
					ДоступностьРедактирование.Удалить(СтрокаРедактирование);
				КонецЕсли;	
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если НЕ РедактированиеПроизводилось И НЕ ТекущиеДанные.Видимость = КешАктивнойСтроки.Видимость Тогда 
			СтрокаРедактирования = ДоступностьРедактирование.Добавить();
			СтрокаРедактирования.ПользовательРоль 	= ТекущиеДанные.Пользователь;
			СтрокаРедактирования.Представление 		= ТекущиеДанные.Представление;
			СтрокаРедактирования.Доступность 		= ТекущиеДанные.Видимость;
		КонецЕсли;	
	КонецЕсли;
	
	ПодсчитатьИтогиПоДоступности();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Доступность роли при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДоступностьРолиПриИзменении(Элемент)
	
	РольПользователей = Неопределено;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		РедактированиеПроизводилось = Ложь;
		Для Каждого СтрокаРедактирование Из ДоступностьРедактирование Цикл 
			Если СтрокаРедактирование.ПользовательРоль = ТекущиеДанные.Пользователь Тогда
				РедактированиеПроизводилось = Истина;
				Если НЕ СтрокаРедактирование.Доступность = ТекущиеДанные.Видимость Тогда 
					ДоступностьРедактирование.Удалить(СтрокаРедактирование);
					РольПользователей = ТекущиеДанные.Пользователь;												
				КонецЕсли;	
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если НЕ РедактированиеПроизводилось И НЕ ТекущиеДанные.Видимость = КешАктивнойСтроки.Видимость Тогда 
			СтрокаРедактирования = ДоступностьРедактирование.Добавить();
			СтрокаРедактирования.ПользовательРоль 	= ТекущиеДанные.Пользователь;
			СтрокаРедактирования.Представление 		= ТекущиеДанные.Представление;
			СтрокаРедактирования.Доступность 		= ТекущиеДанные.Видимость;
			РольПользователей 						= ТекущиеДанные.Пользователь;								
		КонецЕсли;
		Если ЗначениеЗаполнено(РольПользователей) Тогда 
			УстановитьФлагиПользователямПоРоли(РольПользователей, ТекущиеДанные.Видимость);
		КонецЕсли;	
	КонецЕсли;
	
	ПодсчитатьИтогиПоДоступности();

КонецПроцедуры

&НаКлиенте
// Процедура - Доступность пользователи при активизации ячейки
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДоступностьПользователиПриАктивизацииЯчейки(Элемент)
	
	// Кешируем последнюю активную строку
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		КешАктивнойСтроки = Новый Структура("Видимость, Пользователь, Представление", ТекущиеДанные.Видимость, ТекущиеДанные.Пользователь, ТекущиеДанные.Представление);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Доступность роли при активизации ячейки
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДоступностьРолиПриАктивизацииЯчейки(Элемент)
	
	// Кешируем последнюю активную строку
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		КешАктивнойСтроки = Новый Структура("Видимость, Пользователь, Представление", ТекущиеДанные.Видимость, ТекущиеДанные.Пользователь, ТекущиеДанные.Представление);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Группа пользователи роли при смене страницы
//
// Параметры:
//  Элемент			 - 	 - 
//  ТекущаяСтраница	 - 	 - 
//
Процедура ГруппаПользователиРолиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаПользователи Тогда 
		// Кешируем последнюю активную строку
		ТекущиеДанные = Элементы.ДоступностьПользователи.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда 
			КешАктивнойСтроки = Новый Структура("Видимость, Пользователь, Представление", ТекущиеДанные.Видимость, ТекущиеДанные.Пользователь, ТекущиеДанные.Представление);
		КонецЕсли;
	Иначе 
		// Кешируем последнюю активную строку
		ТекущиеДанные = Элементы.ДоступностьРоли.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда 
			КешАктивнойСтроки = Новый Структура("Видимость, Пользователь, Представление", ТекущиеДанные.Видимость, ТекущиеДанные.Пользователь, ТекущиеДанные.Представление);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить флаги пользователям по роли
//
// Параметры:
//  РольПользователей	 - 	 - 
//  Доступность			 - 	 - 
//
Процедура УстановитьФлагиПользователямПоРоли(РольПользователей, Доступность)
	
	МассивПользоватлейИсключение = Новый Массив;
	Для Каждого СтрокаРедактирования Из ДоступностьРедактирование Цикл 
		Если ЗначениеЗаполнено(СтрокаРедактирования.ПользовательРоль) И ТипЗнч(СтрокаРедактирования.ПользовательРоль) = Тип("СправочникСсылка.Сотрудники") Тогда 
			МассивПользоватлейИсключение.Добавить(СтрокаРедактирования.ПользовательРоль);
		КонецЕсли;	
	КонецЦикла;	
	ПользователиРоли = ВернутьПользователейПоРоли(РольПользователей, МассивПользоватлейИсключение, ВариантОтчета);
	Если ЗначениеЗаполнено(ПользователиРоли) Тогда 
		Для Каждого СтрокаДоступностьПользователей Из ДоступностьПользователей Цикл 
			Если НЕ ПользователиРоли.Найти(СтрокаДоступностьПользователей.Пользователь) = Неопределено Тогда 
				СтрокаДоступностьПользователей.Видимость = Доступность;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть пользователей по роли
//
// Параметры:
//  РольПользователей	 - 	 - 
//  МассивИсключений	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьПользователейПоРоли(РольПользователей, МассивИсключений, ВариантОтчета)
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИдентификаторПользователяИБ <> &Идентификатор
	|	И Сотрудники.Роль = &РольПользователей
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.Ссылка В (&МассивИсключений)
	|	И НЕ Сотрудники.Ссылка В
	|				(ВЫБРАТЬ
	|					НастройкиВариантовОтчетов.Пользователь
	|				ИЗ
	|					РегистрСведений.НастройкиВариантовОтчетов КАК НастройкиВариантовОтчетов
	|				ГДЕ
	|					НастройкиВариантовОтчетов.Вариант = &Вариант
	|					И НастройкиВариантовОтчетов.Подсистема = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	|					И НастройкиВариантовОтчетов.Пользователь ССЫЛКА Справочник.Сотрудники
	|					И НЕ НастройкиВариантовОтчетов.Пользователь = НЕОПРЕДЕЛЕНО
	|					И НЕ НастройкиВариантовОтчетов.Пользователь = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Идентификатор"		, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Запрос.УстановитьПараметр("МассивИсключений"	, МассивИсключений);
	Запрос.УстановитьПараметр("РольПользователей"	, РольПользователей);
	Запрос.УстановитьПараметр("Вариант"				, ВариантОтчета);
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

&НаКлиенте
// Процедура - Подсчитать итоги по доступности
//
Процедура ПодсчитатьИтогиПоДоступности()
	
	// Неявный вызов сервера. Форма прыгает.
	// Элементы.СтраницаПользователи.Заголовок = "Пользователи (" + Строка(ДоступностьПользователей.НайтиСтроки(Новый Структура("Видимость", Истина)).Количество()) + ")";
	// Элементы.СтраницаРоли.Заголовок 		= "Роли (" + Строка(ДоступностьРолей.НайтиСтроки(Новый Структура("Видимость", Истина)).Количество()) + ")";
	
	// Надеялся, что форма не будет прыгать
	КоличествоПользователей = 0;
	Для Каждого СтрокаПользователи Из ДоступностьПользователей Цикл 
		КоличествоПользователей = КоличествоПользователей + ?(СтрокаПользователи.Видимость, 1, 0);
	КонецЦикла;
	Для Каждого СтрокаПользователи Из ДоступностьПользователей Цикл 
		СтрокаПользователи.КоличествоПользователей = КоличествоПользователей;
	КонецЦикла;		
	// Элементы.СтраницаПользователи.Заголовок = "Пользователи (" + Строка(КоличествоПользователей) + ")";
	
	КоличествоРолей = 0;
	Для Каждого СтрокаПользователи Из ДоступностьРолей Цикл 
		КоличествоРолей = КоличествоРолей + ?(СтрокаПользователи.Видимость, 1, 0);
	КонецЦикла;
	Для Каждого СтрокаПользователи Из ДоступностьРолей Цикл 
		СтрокаПользователи.КоличествоРолей = КоличествоРолей;
	КонецЦикла;			
	// Элементы.СтраницаРоли.Заголовок = "Роли (" + Строка(КоличествоРолей) + ")";
	
КонецПроцедуры


#КонецОбласти
